-- 1
INSERT INTO aboutus 
    ( aboutus_type,content_type,aboutus_content,publish_time,publisher,delete_flag )
    VALUES
    ("防骗技巧","文段","本系统由Baby Home创始人溪森堡倾情定制。在此，本系统郑重承诺：除您本人在自愿的前提下在“爱心捐助”栏目提供的入口捐助爱心款
     外，本系统不会以任何形式向您和您的家人收取任何费用，我们的一切活动都是公益性的，您捐助的善款也将尽数用于Baby Home求助者。如您在使用本系统的过程中，发现有人向您
     索取（或暗示索取）、敲诈甚至勒索金钱，请一律不要相信、也不要害怕，直接点击小程序下方的“举报”按钮，输入该用户的帐号、用户名、以及情境描述，我们一律进行拉黑处理。
     有明显的勒索、诈骗行为者，可点击右方的“报警”按钮，交由执法部门处理！",
     "2018-05-06","溪森堡",1 
     ),
    ("自律指南","文段","本系统旨在帮助走失、被拐的个人找到家人、帮丢失亲人的家庭放下牵挂。使用本系统，要求登记的
     信息属实、完整。如发现存在恶作剧行为造成公众资源的浪费者，我们严正警告并进行拉黑处理、恶作剧者以后都不能再使用本系统！情节严重
     者，依据我国《治安管理处罚法》第二十五条依法承担法律责任.有下列行为之一的，处五日以上十日一下拘留，可以并处五百元以下罚款;情节较轻的，处五日以下拘留或五百元一下罚款："
     "2018-05-06","溪森堡",1 
     ),
    ("自律指南","法律条文","散布谣言、谎报险情、疫情、警情或者以其他方法故意扰乱公共秩序的",
     "2018-05-06","溪森堡",1 
     ),
    ("自律指南","法律条文","投放虚假的爆炸性、毒害性、放射性、腐蚀性物品或者传染病病原体等危险物质扰乱公共秩序的",
    ,"2018-05-06","溪森堡",1 
     ),
    ("自律指南","法律条文","扬言实施放火、爆炸、投放危险物质扰乱公共秩序的",
     ,"2018-05-06","溪森堡",1 
     ),
    ("关于我们","文段","是一个始建于2019年12月1日的公益组织，起初我们的队伍只有三个壹：壹个大学生、壹台笔记本电脑
     和壹台1核2G的云服务器。经过约莫半年的努力和奋勇拼搏，我们终于迎来了一个强悍的盟友——Baby Home寻亲系统。对！就是各位眼前这个有爱的
     系统！牠将协助我们吸引无数爱心人士加入并壮大这个温暖的家庭，为无数挣扎着寻找亲人的家庭带去光明和希望。我们的目标就是要帮助流离失
     所的人儿找到家人、寻回亲情、放下牵挂！未来可期，邀您一起，共建未来！",
     ,"2018-05-06","溪森堡",1 
     );

-- 2
INSERT INTO crackabduction 
    ( crackabduction_type, movieimg_url,crackabduction_content,publish_time,delete_flag )
    VALUES
    ( "普法宣传","","
    《刑法》第二百四十条规定：拐卖妇女儿童罪是指以出卖为目的，拐骗、绑架、收买、贩卖、施诈、接送、中转妇女、儿童的行为。拐卖妇女、儿童的，处5年以上10年以下有期徒刑，并处罚金，情节特别严重的，处死刑。
    ","2018-05-06",1 ),
    ( "普法宣传","","
    《刑法》第二百四十一条第六款：“收买被拐卖的妇女、儿童，对被买儿童没有虐待行为，不阻碍对其进行解救的，可以从轻处罚；按照被买妇女的意愿，不阻碍其返回原居住地的，可以从轻或减轻处罚。”《刑法（修正案九）》为打击买方市场提供了有力的法律武器。
    ","2018-05-06",1 ),
    ( "普法宣传","","
    警方特别提醒:没有买卖,就没有伤害,收买被拐卖妇女儿童也是犯罪！
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    小朋友避免独自一人出门，要和父母或者小伙伴一起
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    遇见陌生人问路的时候，可以为其指路，但是一定不能带路
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    陌生人给的食物和玩具绝对不能要
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    小朋友独自一人走在路上，遇见陌生人纠缠，可以假装父母在附近，并且大声喊爸爸妈妈
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    发现有人跟踪时，尽快往人多的地方走，向保安叔叔或者警察求助
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    碰到陌生人拦截时，千万不要主动和陌生人发生冲突、避免惹怒坏人，要尽快往反方向跑，边跑边呼喊求救
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    若不幸被坏人带走囚禁起来，尽可能寻找机会逃脱（想办法发求助信号如SOS、发短信、打电话报警等）
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    事先和父母约定接学的密码，让小朋友分辨接学人身份，防范坏人冒充家长或家长亲戚朋友接孩子放学
    ","2018-05-06",1 ),
    ( "防拐窍门","","
    不要在没有父母亲人陪同的情况下搭乘陌生人的车
    ","2018-05-06",1 ),
    ( "热映电影","../../images/home/mangshan.jpg","
    《盲山》是2007年李杨导演的一部电影，由黄璐等人主演，影片将目光投向了中国长期不断的社会问题——人口拐卖。这部影片，不单单勇于揭露了社会的真实性。更勇敢的一点，在于敢于直指人性的愚昧无知
    ","2018-05-06",1 ),
    ( "热映电影","../../images/home/qinaide.jpg","
    《亲爱的》是2014年出品的一部“打拐题材”电影，由陈可辛执导，张冀编剧，赵薇、黄渤、佟大为、郝蕾、张译等主演。电影主演讲述以田文军为首的一群失去孩子的父母去寻孩子以及养育被拐孩子的农村妇女李红琴如何为夺取孩子做抗争的故事。
    ","2018-05-06",1 ),
    ( "热映电影","../../images/home/shigu.jpg","
    《失孤》是2015年的华谊兄弟制作的一部“打拐”题材的电影，由彭三源自编自导，刘德华、井柏然、吴君如等主演。影片讲述了1998年，雷泽宽两岁的儿子雷达丢了，雷泽宽开始了长达十四年的寻子之路。一路上雷泽宽历经艰辛，还认识了四岁时被拐修车小伙曾帅。雷泽宽帮曾帅找到了失散多年的亲人，带着曾帅送他的导航仪继续自己的寻子之路
    ","2018-05-06",1 );

--3 
INSERT INTO seeker 
    ( seeker_openid,wechat_nickname,phone_number,seeker_avartar_url,account_status )
    VALUES
    ( "wx01010101010101","溪森堡","15113493359","../../images/home/shigu.jpg",1 ),
    ( "wx01454656767776","alpha","13148867890","../../images/home/mangshan.jpg",1 );

--4 
INSERT INTO volunteer 
    ( volunteer_openid,account,v_name,sex,birthday,idcard,phone_number,qq,usual_place,current_place,avartar_url,account_status )
    VALUES
    ( "wx01010101010101","435563793","胡大大","女","1998-09-07","441427199809073388","15113493359","435563793","广东省湛江市赤坎区寸进路29号","广东省湛江市赤坎区寸进路29号","../../images/home/shigu.jpg",1 ),
    ( "wx01490088866655","436678938","张三","男","1998-09-08","441528199809083398","15326789023","666564345","广东省广州市白云区才华有限公司","广东省广州市白云区才华有限公司","../../images/home/qinaide.jpg",1 );
    ( "wx09045348567894","748354543","Allen","男","1998-11-08","4634199811083888","13146636090","748354543","广东省广州市白云区才华有限公司","广东省广州市白云区才华有限公司","../../images/home/mangshan.jpg",1 );

-- 5
INSERT INTO user_tables 
    ( user_account,user_pwd,authority,account_status )
    VALUES
    ( "wx01010101010101","hst168168",'administrator',1 ),
    ( "wx09045348567894","99999999","volunteer",1 ),
    ( "wx01454656767776","12345678","volunteer",1 );

-- 6
INSERT INTO blacklist 
    ( user_openid,volunteer_account,add_time,add_reason )
    VALUES
    ( "wx01454656767776","12345678","volunteer",1 );

-- 7
INSERT INTO advice 
    ( email,advice_content,refer_time )
    VALUES
     ( "435563793@qq.com","界面不够完美啊,一定要做得很漂亮很漂亮哦","2019-09-09 12:29:20" ),
     ( "18475969302@163.com","字体有点呆板,看着不是特别舒适","2019-02-02 09:19:40" );


-- 8
INSERT INTO donate 
    ( donator_name,sum_of_money,usage_type,donate_time )
    VALUES
     ( "梅才华",2000.00,"帮助流浪儿童","2019-09-09 12:29:20" ),
     ( "张山",1000.30,"帮助贫困家庭","2019-07-09 09:30:20" ),
     ( "李斯",200.00,"帮助贫困家庭","2019-04-03 12:50:20" ),
     ( "王武",400.46,"帮助流浪儿童","2019-05-02 19:19:40" );

-- 9
INSERT INTO expenditure 
    ( expend_count,expend_usage_desc,expend_time )
    VALUES
     ( 1000,"帮助大三元门口发现的流浪儿童","2020-01-09 12:29:20" ),
     ( 800,"帮助中华楼旁边的贫困家庭","2019-10-19 09:30:20" ),
     ( 500,"帮助贫困家庭","2020-04-03 12:50:20" ),
     ( 600,"帮助流浪儿童","2019-12-21 19:19:40" );



-- 15 举报
INSERT INTO accusation 
    ( accuse_type,accused,accused_phone,notes,picture_url )
    VALUES
     ( "涉嫌诈骗","Alllen","13146636090","他说知道我儿子的下落,但是要给1万元,结果骗人的","../../images/home/mangshan.jpg" ),
     ( "发布虚假信息","Alllen","13146636090","他昨天发布的消息是假的,今天早上我还看见他儿子了","../../images/home/mangshan.jpg" ),
     ( "敲诈勒索","Malia","15116636090","他说不给钱不跟进,其他志愿者也跟进不了","../../images/home/qinaide.jpg" );






-- INSERT INTO success_example 
--     ( example_title,example_content,publish_time,publisher,find_type,find_id,delete_flag )
--     VALUES
--     ( "热映电影","../../images/home/shigu.jpg","
--     《失孤》是2015年的华谊兄弟制作的一部“打拐”题材的电影，由彭三源自编自导，刘德华、井柏然、吴君如等主演。影片讲述了1998年，雷泽宽两岁的儿子雷达丢了，雷泽宽开始了长达十四年的寻子之路。一路上雷泽宽历经艰辛，还认识了四岁时被拐修车小伙曾帅。雷泽宽帮曾帅找到了失散多年的亲人，带着曾帅送他的导航仪继续自己的寻子之路
--     ","2018-05-06",1 ),







-- INSERT INTO 
-- [表名]([列名],[列名]) 
--  VALUES
-- ([列值],[列值])),
-- ([列值],[列值])),
-- ([列值],[列值]));